[Abilities.A_Burns_Buff H7BaseBuff]
mName="燃烧"
mTooltip="在回合开始时造成 %d.min 到 %d.max %d.icon 火焰伤害。持续 %durnow 回合。"

[Abilities.A_DevouringInfection H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="感染性吞噬"
mTooltip="所有附近的敌方生命单位将受到感染影响（%buff1.buff.stat1 %ICON_ATTACK 攻击力，%buff1.buff.stat2 %ICON_DEFENSE 防御力），只要这些单位在清道夫附近，效果就持续。对受感染单位的攻击会恢复清道夫的生命值。"

[A_triple_attack_Buff_DamageDecrease H7BaseBuff]
mName=""
mTooltip=""

[Abilities.A_LifeDrain H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="生命汲取"
mTooltip="该生物所受的伤害会返还相当于所造成伤害一半的生命值。这也会复活战斗中倒下的生物。"

[Abilities.A_DevouringInfection_Buff H7BaseBuff]
mName="感染性吞噬"
mTooltip="%stat1 %ICON_ATTACK 攻击力，%stat2 %ICON_DEFENSE 防御力。只要该单位在清道夫附近就持续。"

[Abilities.dammage_triple H7BaseBuff]
mName="狂怒"
mTooltip="该单位处于狂暴的出神状态。%stat1 %icon_attack 攻击力，%stat2 %icon_might_damage 造成最大伤害，%stat3 %icon_movement 移动力，持续 %durnow 回合。"

[Abilities.triple_tir H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="野火"
mTooltip="近战攻击有15%幸运几率释放一种挥发性物质，矿坑甲虫会立即点燃它，对所有附近的敌方单位造成 %d1.min 到 %d1.max 火焰伤害。此外，攻击者可能会被点燃。"

[Abilities.WildFire H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="野火"
mTooltip="近战攻击有15%幸运几率释放一种挥发性物质，矿坑甲虫会立即点燃它，对所有附近的敌方单位造成 %d1.min 到 %d1.max 火焰伤害。此外，攻击者可能会被点燃。"

[Creatures.A_CreatureScavenger H7Creature]
mName="清道夫"
mLore="秽巢的知识使得制造一种武器成为可能。这种武器由一个装有强大土系魔法的储罐、一个古老的曲柄系统和一个金属管组成，可以以惊人的速度发射多个魔法射弹。但所有这些机械需要两名士兵才能操作。"

[Creatures.A_CreatureSpawn H7Creature]
mName="铁嚼者"
mLore="铁嚼者拥有更好的身体防护，为了制造它们的装甲，它们使用金属，并事先对其进行揉捏。"

____________________________________________

版本 1.30:

[Abilities.A_Nova H7CreatureAbility]
mTooltipMagicGuild=""
mTooltipMagicGuildRankLine=""
mTooltipUpgraded=""
mName="破坏者"
mTooltip="此攻击有50%的几率对目标再次造成 %d1 %icon_earth 土系伤害，有25%的几率对目标第三次造成 %d1 %icon_earth 土系伤害。"